/* 
// ফাংশন স্কোপ: 
// যখন একটি ভেরিয়েবল একটি ফাংশনের ভিতরে ঘোষণা করা হয়, তখন এটি শুধুমাত্র সেই ফাংশনের মধ্যে অ্যাক্সেসযোগ্য এবং সেই ফাংশনের বাইরে ব্যবহার করা যায় না। 
// ব্লক স্কোপ: 
// একটি পরিবর্তনশীল যখন if বা switch অবস্থার ভিতরে ঘোষণা করা হয় বা লুপগুলির জন্য বা ভিতরে ঘোষণা করা হয়, তখন সেই নির্দিষ্ট অবস্থা বা লুপের মধ্যে অ্যাক্সেসযোগ্য। 
*/

function add(a, b) {
   const total = a + b
   console.log(a, b)

   if (b > 5) {
      const sum = 25 + a + b
   } else {
      const sum = 5 + a + b
      var current = sum
   }
   console.log(current)
   return total
}
add(5, 7)